In [114]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [115]:
bch= pd.read_csv(r"D:\Oprec\Penugasan Divisi Data Science\Penugasan Divisi Data Science\crypto_data\BTC-USD.csv")
btc= pd.read_csv(r"D:\Oprec\Penugasan Divisi Data Science\Penugasan Divisi Data Science\crypto_data\BTC-USD.csv")
eth= pd.read_csv(r"D:\Oprec\Penugasan Divisi Data Science\Penugasan Divisi Data Science\crypto_data\ETH-USD.csv")
ltc= pd.read_csv(r"D:\Oprec\Penugasan Divisi Data Science\Penugasan Divisi Data Science\crypto_data\LTC-USD.csv")

In [116]:
bch.head(2)

,1528968660,6489.549805,6489.560059,6489.560059.1,6489.549805.1,0.587100
0,1528968720,6487.370117,6489.560059,6489.549805,6487.379883,7.706374
1,1528968780,6479.410156,6487.370117,6487.370117,6479.410156,3.088252

In [117]:
btc.head(2)

,1528968660,6489.549805,6489.560059,6489.560059.1,6489.549805.1,0.587100
0,1528968720,6487.370117,6489.560059,6489.549805,6487.379883,7.706374
1,1528968780,6479.410156,6487.370117,6487.370117,6479.410156,3.088252

In [118]:
eth.head(2)

   1528968720  485.989990  486.500000  486.019989  486.010010  26.019083
0  1528968780      486.00       486.0       486.0      486.00   8.449400
1  1528968840      485.75       486.0       486.0      485.75  26.994646

In [119]:
ltc.head(2)

   1528968660  96.580002  96.589996  96.589996.1  96.580002.1    9.647200
0  1528968720  96.449997  96.669998    96.589996    96.660004  314.387024
1  1528968780  96.470001  96.570000    96.570000    96.570000   77.129799

In [ ]:
#belum selesai